"use strict";
var __decorate = (this && this.__decorate) || function (decorators, target, key, desc) {
    var c = arguments.length, r = c < 3 ? target : desc === null ? desc = Object.getOwnPropertyDescriptor(target, key) : desc, d;
    if (typeof Reflect === "object" && typeof Reflect.decorate === "function") r = Reflect.decorate(decorators, target, key, desc);
    else for (var i = decorators.length - 1; i >= 0; i--) if (d = decorators[i]) r = (c < 3 ? d(r) : c > 3 ? d(target, key, r) : d(target, key)) || r;
    return c > 3 && r && Object.defineProperty(target, key, r), r;
};
var core_1 = require("@angular/core");
var ReportDataService = (function () {
    function ReportDataService() {
        this.data = [
            { plus: true, content: "一、营业收入(填写A101010\\101020\\103000)", comment: "填报纳税人主要经营业务和其他经营业务取得的收入总额。本行根据“主营业务收入”和“其他业务收入”的数额填报。一般企业纳税人通过《一般企业收入明细表》（A101010）填报；金融企业纳税人通过《金融企业收入明细表》(A101020)填报；事业单位、社会团体、民办非企业单位、非营利组织等纳税人通过《事业单位、民间非营利组织收入、支出明细表》(A103000)填报。" },
            { plus: true, content: "    减：营业成本(填写A102010\\102020\\103000)", comment: "填报纳税人主要经营业务和其他经营业务发生的成本总额。本行根据“主营业务成本”和“其他业务成本”的数额填报。一般企业纳税人通过《一般企业成本支出明细表》(A102010)填报；金融企业纳税人通过《金融企业支出明细表》(A102020)填报；事业单位、社会团体、民办非企业单位、非营利组织等纳税人，通过《事业单位、民间非营利组织收入、支出明细表》(A103000)填报。" },
            { content: "        营业税金及附加", comment: "填报纳税人经营活动发生的营业税、消费税、城市维护建设税、资源税、土地增值税和教育费附加等相关税费。本行根据纳税人相关会计科目填报。纳税人在其他会计科目核算的本行不得重复填报。" },
            { plus: true, content: "        销售费用(填写A104000)", comment: "填报纳税人在销售商品和材料、提供劳务的过程中发生的各种费用。本行通过《期间费用明细表》（A104000）中对应的“销售费用”填报。" },
            { plus: true, content: "        管理费用(填写A104000)", comment: "填报纳税人为组织和管理企业生产经营发生的管理费用。本行通过《期间费用明细表》（A104000）中对应的“管理费用”填报。" },
            { plus: true, content: "        财务费用(填写A104000)", comment: "填报纳税人为筹集生产经营所需资金等发生的筹资费用。本行通过《期间费用明细表》（A104000）中对应的“财务费用”填报。" },
            { content: "        资产减值损失", comment: "填报纳税人计提各项资产准备发生的减值损失。本行根据企业“资产减值损失”科目上的数额填报。实行其他会计准则等的比照填报。" },
            { content: "    加：公允价值变动收益", comment: "填报纳税人在初始确认时划分为以公允价值计量且其变动计入当期损益的金融资产或金融负债（包括交易性金融资产或负债，直接指定为以公允价值计量且其变动计入当期损益的金融资产或金融负债），以及采用公允价值模式计量的投资性房地产、衍生工具和套期业务中公允价值变动形成的应计入当期损益的利得或损失。本行根据企业“公允价值变动损益”科目的数额填报。（损失以“-”号填列）" },
            { content: "        投资收益", comment: "填报纳税人以各种方式对外投资确认所取得的收益或发生的损失。根据企业“投资收益”科目的数额计算填报；实行事业单位会计准则的纳税人根据“其他收入”科目中的投资收益金额分析填报（损失以“-”号填列）。实行其他会计准则等的比照填报。" },
            { content: "二、营业利润(1-2-3-4-5-6-7+8+9)", comment: "填报纳税人当期的营业利润。根据上述项目计算填列。" },
            { plus: true, content: "    加：营业外收入(填写A101010\\101020\\103000)", comment: "填报纳税人取得的与其经营活动无直接关系的各项收入的金额。一般企业纳税人通过《一般企业收入明细表》（A101010）填报；金融企业纳税人通过《金融企业收入明细表》(A101020)填报；实行事业单位会计准则或民间非营利组织会计制度的纳税人通过《事业单位、民间非营利组织收入、支出明细表》(A103000)填报。" },
            { plus: true, content: "    减：营业外支出(填写A102010\\102020\\103000)", comment: "填报纳税人发生的与其经营活动无直接关系的各项支出的金额。一般企业纳税人通过《一般企业成本支出明细表》(A102010)填报；金融企业纳税人通过《金融企业支出明细表》(A102020)填报；实行事业单位会计准则或民间非营利组织会计制度的纳税人通过《事业单位、民间非营利组织收入、支出明细表》(A103000)填报。" },
            { content: "三、利润总额（10+11-12）", comment: "填报纳税人当期的利润总额。根据上述项目计算填列。" },
            { plus: true, content: "    减：境外所得（填写A108010）", comment: "填报纳税人发生的分国（地区）别取得的境外税后所得计入利润总额的金额。填报《境外所得纳税调整后所得明细表》(A108010)第14列减去第11列的差额。" },
            { plus: true, content: "    加：纳税调整增加额（填写A105000）", comment: "填报纳税人会计处理与税收规定不一致，进行纳税调整增加的金额。本行通过《纳税调整项目明细表》（A105000）“调增金额”列填报。" },
            { plus: true, content: "    减：纳税调整减少额（填写A105000）", comment: "填报纳税人会计处理与税收规定不一致，进行纳税调整减少的金额。本行通过《纳税调整项目明细表》（A105000）“调减金额”列填报。" },
            { plus: true, content: "    减：免税、减计收入及加计扣除（填写A107010）", comment: "填报属于税法规定免税收入、减计收入、加计扣除金额。本行通过《免税、减计收入及加计扣除优惠明细表》（A107010）填报。" },
            { plus: true, content: "    加：境外应税所得抵减境内亏损（填写A108000）", comment: "填报纳税人根据税法规定，选择用境外所得抵减境内亏损的数额。本行通过《境外所得税收抵免明细表》（A108000）填报。" },
            { content: "四、纳税调整后所得（13-14+15-16-17+18）", comment: "填报纳税人经过纳税调整、税收优惠、境外所得计算后的所得额。" },
            { plus: true, content: "    减：所得减免（填写A107020）", comment: "填报属于税法规定所得减免金额。本行通过《所得减免优惠明细表》(A107020)填报，本行＜0时，填写负数。" },
            { plus: true, content: "    减：抵扣应纳税所得额（填写A107030）", comment: "填报根据税法规定应抵扣的应纳税所得额。本行通过《抵扣应纳税所得额明细表》（A107030）填报。" },
            { plus: true, content: "    减：弥补以前年度亏损（填写A106000）", comment: "填报纳税人按照税法规定可在税前弥补的以前年度亏损的数额，本行根据《企业所得税弥补亏损明细表》（A106000）填报。" },
            { content: "五、应纳税所得额（19-20-21-22）", comment: "金额等于本表第19-20-21-22行计算结果。本行不得为负数。本表第19行或者按照上述行次顺序计算结果本行为负数，本行金额填零。" },
            { content: "    税率（25%）", comment: "填报税法规定的税率25%。" },
            { content: "六、应纳所得税额（23×24）", comment: "金额等于本表第23×24行" },
            { plus: true, content: "    减：减免所得税额（填写A107040）", comment: "填报纳税人按税法规定实际减免的企业所得税额。本行通过《减免所得税优惠明细表》（A107040）填报。" },
            { plus: true, content: "    减：抵免所得税额（填写A107050）", comment: "填报企业当年的应纳所得税额中抵免的金额。本行通过《税额抵免优惠明细表》（A107050）填报。" },
            { content: "七、应纳税额（25-26-27）", comment: "金额等于本表第25-26-27行。" },
            { plus: true, content: "    加：境外所得应纳所得税额（填写A108000）", comment: "填报纳税人来源于中国境外的所得，按照我国税法规定计算的应纳所得税额。本行通过《境外所得税收抵免明细表》（A108000）填报。" },
            { plus: true, content: "    减：境外所得抵免所得税额（填写A108000）", comment: "填报纳税人来源于中国境外所得依照中国境外税收法律以及相关规定应缴纳并实际缴纳（包括视同已实际缴纳）的企业所得税性质的税款（准予抵免税款）。本行通过《境外所得税收抵免明细表》（A108000）填报。" },
            { content: "八、实际应纳所得税额（28+29-30）", comment: "填报纳税人当期的实际应纳所得税额。金额等于本表第28+29-30行。" },
            { content: "    减：本年累计实际已预缴的所得税额", comment: "填报纳税人按照税法规定本纳税年度已在月（季）度累计预缴的所得税额，包括按照税法规定的特定业务已预缴（征）的所得税额，建筑企业总机构直接管理的跨地区设立的项目部按规定向项目所在地主管税务机关预缴的所得税额。" },
            { content: "九、本年应补（退）所得税额（31-32）", comment: "填报纳税人当期应补（退）的所得税额。金额等于本表第31-32行。" },
            { plus: true, content: "    其中：总机构分摊本年应补（退）所得税额(填写A109000)", comment: "填报汇总纳税的总机构按照税收规定在总机构所在地分摊本年应补（退）所得税款。本行根据《跨地区经营汇总纳税企业年度分摊企业所得税明细表》（A109000）填报。" },
            { plus: true, content: "          财政集中分配本年应补（退）所得税额（填写A109000）", comment: "填报汇总纳税的总机构按照税收规定财政集中分配本年应补（退）所得税款。本行根据《跨地区经营汇总纳税企业年度分摊企业所得税明细表》（A109000）填报。" },
            { plus: true, content: "          总机构主体生产经营部门分摊本年应补（退）所得税额(填写A109000)", comment: "填报汇总纳税的总机构所属的具有主体生产经营职能的部门按照税收规定应分摊的本年应补（退）所得税额。本行根据《跨地区经营汇总纳税企业年度分摊企业所得税明细表》（A109000）填报。" },
            { content: "以前年度多缴的所得税额在本年抵减额", comment: "填报纳税人以前纳税年度汇算清缴多缴的税款尚未办理退税、并在本纳税年度抵缴的所得税额。" },
            { content: "以前年度应缴未缴在本年入库所得税额", comment: "填报纳税人以前纳税年度应缴未缴在本纳税年度入库所得税额。" }
        ];
        this.cata = [
            { name: "利润总额计算", span: 13 },
            { name: "应纳税所得额计算", span: 10 },
            { name: "应纳税额计算", span: 13 },
            { name: "附列资料", span: 2 }
        ];
    }
    ReportDataService.prototype.report = function () {
        return this.data;
    };
    ReportDataService.prototype.reportCata = function () {
        return this.cata;
    };
    return ReportDataService;
}());
ReportDataService = __decorate([
    core_1.Injectable()
], ReportDataService);
exports.ReportDataService = ReportDataService;
//# sourceMappingURL=report1.service.js.map